k = int(input("Введите натуральное число не превосходящее 8:"))

l = int(input("Введите натуральное число не превосходящее 8:"))

m = int(input("Введите натуральное число не превосходящее 8:"))

n = int(input("Введите натуральное число не превосходящее 8:"))

figura = input("Введите одну из фигур(ферзь, ладья, слон, конь):")

s = 0
d = 0
h = 0

if ((k+l) % 2 == 0) and ((m+n) % 2 == 0):
    print("Поля одного цвета")
elif ((k+l) % 2 != 0) and ((m+n) % 2 != 0):
    print("Поля одного цвета")
else:
    print("Поля разных цветов")

if figura == "ладья":
    if k == m:
        print("Ладья угражает полю", m, ",", n)
        print("Ладья может попасть в поле", m, ",", n,"за один ход")
    elif l == n:
        print("Ладья угражает полю", m, ",", n)
        print("Ладья может попасть в поле", m, ",", n,"за один ход")
    else:
        print("Ладья не угражает полю", m, ",", n)
        print("Ладья не может попасть в поле", m, ",", n,"за один ход")
        print("Чтобы попасть туда за два хода, первый ход будет на:", m, ":", l)

if figura == "конь":
    if (k == (m - 1) and l == (n + 2)) or (k == (m - 1) and l == (n - 2)) or (k == (m + 1) and l == (n + 2)) or (k == (m + 1) and l == (n - 2)) or (k == (m - 2) and l == (n + 1)) or (k == (m - 2) and l == (n - 1)) or (k == (m + 2) and l == (n + 1)) or (k == (m + 2) and l == (n - 1)):
        print("Конь угражает полю", m, ",", n)
        print("Конь может попасть в поле", m, ",", n,"за один ход")
    else:
        print("Конь не угражает полю", m, ",", n)
        print("Конь не может попасть в поле", m, ",", n,"за один ход")

if figura == "слон":
    for i in range(1,9):
        if (k == (m-i) and l == (n-i)) or (k == (m-i) and l == (n+i)) or (k == (m+i) and l == (n-i)) or (k == (m+i) and l == (n+i)):
            print("Слон угражает полю", m, ",", n)
            print("Слон может папасть в поле", m, ",", n,"за один ход")
            s = 1
    if s != 1:
        print("Слон не угражает полю", m, ",", n)
        print("Слон не может попасть в поле", m, ",", n,"за один ход")
    if (k+l)%2 != (n+m)%2:
        print("Слон не может попасть в поле", m, ",", n,"никогда")
    else:
        print("Со слоном не придумал как это сделать=(")

    
if figura == "ферзь":
    for i in range(1,9):
        if (k == (m-i) and l == (n-i)) or (k == (m-i) and l == (n+i)) or (k == (m+i) and l == (n-i)) or (k == (m+i) and l == (n+i)) or (k == m) or (l == n):
            h = 1
            d = 1
    if d != 1:
        print("Ферзь не угражает полю", m, ",", n)
        print("Ферзь не может попасть в поле", m, ",", n,"за один ход")
        print("Чтобы попасть туда за два хода, первый ход будет на:", m, ":", l)
    if h == 1:
        print("Ферзь угражает полю", m, ",", n)
        print("Ферзь может попасть в поле", m, ",", n,"за один ход")
